{
    "F1_advice": "The Frontal lobe score of 69.76 suggests moderate performance in motor control, planning, coordination, and executive functions. To improve, engage in activities that challenge executive function, such as puzzles, strategic games, or learning new skills. Physical exercise, especially aerobic activities, can enhance motor coordination. Mindfulness practices may help with impulse control. If daily tasks are affected, consider breaking them into smaller steps. For maintenance, maintain a structured routine and avoid multitasking to reduce cognitive load. Consult a specialist if you notice persistent difficulties in decision-making or motor tasks.",
    "F2_advice": "The Parietal lobe score of 69.36 indicates moderate spatial awareness, sensory integration, and attention. To enhance these functions, practice activities like drawing, navigation exercises, or spatial puzzles (e.g., jigsaw puzzles). Mindfulness meditation can improve attention. Sensory integration activities, such as tactile exercises or balancing tasks, may also help. If you experience frequent disorientation or attention lapses, reduce distractions in your environment. For maintenance, stay physically active and engage in tasks requiring hand-eye coordination. Seek professional advice if spatial or sensory issues interfere with daily life.",
    "F3_advice": "The Hippocampus score of 66.82 reflects moderate memory and emotional regulation performance. To boost memory, try mnemonic techniques, spaced repetition learning, or memory games. Regular aerobic exercise promotes neurogenesis in the hippocampus. For emotional health, practice stress-reduction techniques like deep breathing or journaling. Social interactions and novel experiences can also strengthen memory. If forgetfulness is frequent, establish routines and use reminders. For maintenance, prioritize sleep and a balanced diet rich in omega-3s. Consult a neurologist if memory lapses or mood swings persist.",
    "F4_advice": "The Occipital lobe score of 72.91 indicates strong visual processing and recognition. To maintain this, engage in visual tasks like reading, art, or pattern recognition games. Protect eye health with regular check-ups and reduce screen time to prevent strain. If you notice visual disturbances, ensure proper lighting and take breaks during visually demanding tasks. For enhancement, try activities requiring visual memory, such as memorizing scenes or faces. A diet rich in antioxidants supports visual health. Seek medical advice if you experience persistent visual issues like blurriness or difficulty recognizing objects.",
    "F5_advice": "The Temporal lobe score of 72.91 suggests strong auditory processing, language, and emotional recognition. To maintain this, engage in listening exercises, music, or language learning. Reading aloud or discussing complex topics can sharpen language skills. For emotional recognition, practice active listening and empathy-building activities. Protect hearing by avoiding loud noises and using ear protection when needed. If you experience language or memory difficulties, use repetition and association techniques. For enhancement, explore audiobooks or podcasts. Consult a specialist if you notice persistent auditory or language challenges."
}