{
    "F1_advice": "The frontal lobe score of 60.61 suggests moderate functioning in motor control, planning, coordination, and executive control. To improve, engage in activities that challenge executive functions, such as puzzles, strategic games, or learning new skills. Physical exercise, especially aerobic activities, can enhance motor coordination. Mindfulness practices may help with impulse control. If daily tasks are challenging, break them into smaller steps. Consider cognitive behavioral therapy (CBT) to address planning difficulties. Avoid multitasking to reduce cognitive load. Regular sleep and a balanced diet are essential for optimal frontal lobe function.",
    "F2_advice": "The parietal lobe score of 63.53 indicates adequate spatial awareness and sensory integration but room for improvement. Practice activities requiring spatial navigation, like drawing, map-reading, or 3D puzzles. Mindfulness exercises can enhance attention. Sensory integration tasks, such as tactile discrimination (e.g., identifying objects by touch), may help. Limit distractions during tasks requiring focus. Occupational therapy could be beneficial for sensory processing issues. Ensure adequate vitamin B12 and omega-3 intake, as deficiencies can affect parietal function. Regular physical activity, especially yoga or tai chi, can improve spatial awareness.",
    "F3_advice": "The hippocampus score of 57.62 suggests mild memory and emotional processing challenges. Strengthen memory through techniques like spaced repetition, mnemonic devices, or learning new languages. Aerobic exercise boosts hippocampal neurogenesis. Mindfulness and stress reduction (e.g., meditation) can improve emotional regulation. Social interactions and novel experiences stimulate hippocampal activity. Avoid excessive alcohol, which harms the hippocampus. Consider omega-3 supplements and a Mediterranean diet for brain health. If memory lapses persist, consult a specialist for further evaluation. Sleep is critical for memory consolidation—aim for 7-9 hours nightly.",
    "F4_advice": "The occipital lobe score of 66.54 reflects solid visual processing but potential for refinement. Enhance visual skills with activities like jigsaw puzzles, pattern recognition games, or art. Protect eye health with regular check-ups and reduce screen time to prevent strain. Practice visual memory exercises, such as recalling details from a scene. Ensure adequate lighting for tasks requiring visual precision. Foods rich in lutein (e.g., leafy greens) support visual processing. If experiencing visual disturbances, seek professional advice. Balance visual tasks with breaks to avoid fatigue.",
    "F5_advice": "The temporal lobe score of 66.54 indicates strong auditory and language processing but room for growth. Stimulate auditory memory with music, podcasts, or language learning. Reading aloud or engaging in debates can sharpen language skills. Protect hearing by avoiding loud noises. Emotional processing can be improved through therapy or journaling. If word-finding difficulties occur, practice naming objects or storytelling. Maintain social connections to bolster verbal communication. Sleep and stress management are vital for memory consolidation. Consider auditory training apps for further enhancement. A diet rich in antioxidants supports temporal lobe health."
}