{
    "F1_advice": "The frontal lobe score of 71.31 suggests moderate function in motor control, planning, coordination, and executive control. To improve, engage in activities that challenge executive function, such as puzzles, strategic games, or learning new skills. Physical exercise, especially aerobic activities, can enhance motor coordination. Mindfulness practices may help with impulse control. If daily tasks feel overwhelming, break them into smaller steps. Consult a specialist if you notice persistent difficulties in planning or decision-making, as targeted cognitive training or occupational therapy might be beneficial.",
    "F2_advice": "The parietal lobe score of 71.86 indicates adequate spatial awareness and sensory integration but room for improvement. Practice activities requiring spatial reasoning, like drawing, map-reading, or 3D puzzles. Mindfulness exercises can sharpen attention. If you struggle with navigation, try using landmarks instead of GPS. Sensory stimulation, such as tactile tasks or balancing exercises, may enhance integration. Occupational therapy could help if sensory processing issues interfere with daily life. Monitor for signs of neglect or difficulty with multitasking, as these may warrant further evaluation.",
    "F3_advice": "The hippocampus score of 66.29 reflects mild challenges in memory and emotional regulation. Strengthen memory with techniques like spaced repetition, mnemonic devices, or learning new languages. Regular physical activity, especially aerobic exercise, boosts hippocampal neurogenesis. Stress management (e.g., meditation, deep breathing) is crucial, as chronic stress impairs hippocampal function. Social engagement and creative hobbies can support emotional health. If memory lapses persist, consider cognitive testing. A diet rich in omega-3s and antioxidants may also promote hippocampal health.",
    "F4_advice": "The occipital lobe score of 72.11 suggests solid visual processing but potential for refinement. Stimulate this region with visual puzzles, art, or photography. Protect eye health with regular check-ups and screen breaks. If visual recognition feels sluggish, practice identifying objects quickly or playing memory games. Ensure adequate lighting for tasks. If you experience visual disturbances (e.g., blurriness or difficulty recognizing faces), consult a specialist. Activities like juggling or sports can enhance hand-eye coordination. A diet with vitamins A and E supports visual function.",
    "F5_advice": "The temporal lobe score of 72.11 indicates good auditory and language processing but room for growth. Enhance auditory memory by listening to music or podcasts and summarizing details. Language skills can be sharpened through reading, writing, or learning new words. Emotional regulation may benefit from mindfulness or therapy. If word-finding difficulties arise, practice naming objects quickly. Protect hearing by avoiding loud noises. Social interactions and storytelling can strengthen associative memory. If auditory hallucinations or severe memory gaps occur, seek professional evaluation. A balanced diet and sleep hygiene support temporal lobe health."
}