{
    "F1_advice": "The Frontal lobe score of 82.53 indicates strong motor control, planning, and executive function. To maintain and enhance these abilities, engage in activities that challenge coordination and decision-making, such as strategic games, physical exercise, or learning new skills. Mindfulness practices can improve focus and impulse control. If you notice any decline in organization or motivation, consider structured routines or cognitive training apps. Avoid excessive stress, as it can impair executive function. Regular sleep and a balanced diet rich in omega-3s and antioxidants will support brain health.",
    "F2_advice": "With a Parietal lobe score of 81.46, spatial awareness and sensory integration are well-maintained. To further strengthen these functions, practice activities like puzzles, navigation exercises, or hand-eye coordination tasks (e.g., drawing or playing an instrument). Mindfulness and meditation can enhance attention. If you experience difficulty with spatial tasks, try breaking them into smaller steps. Limit multitasking to improve focus. Ensure adequate vitamin B12 and iron intake to support sensory processing. Regular physical activity, especially yoga or tai chi, can also benefit spatial cognition.",
    "F3_advice": "The Hippocampus score of 81.49 reflects solid memory and emotional regulation. To boost these functions, engage in memory-enhancing activities like learning new languages, recalling details from your day, or using mnemonic devices. Aerobic exercise promotes neurogenesis in the hippocampus. Manage stress through relaxation techniques, as chronic stress can impair memory. Social interactions and novel experiences stimulate hippocampal activity. A diet rich in flavonoids (e.g., berries, dark chocolate) and omega-3s supports memory. If forgetfulness increases, consider journaling or digital reminders to compensate.",
    "F4_advice": "An Occipital lobe score of 78.52 suggests mild challenges in visual processing. To improve, practice visual exercises like identifying subtle differences in images, reading, or playing visual memory games. Protect eye health with regular check-ups and reduce screen time to prevent strain. Incorporate foods high in lutein (e.g., leafy greens, eggs) to support vision. If you struggle with visual tasks, use tools like magnifiers or high-contrast settings. Ensure proper lighting when reading or working. Activities like drawing or photography can also sharpen visual perception. Address any underlying conditions (e.g., migraines) that may affect visual processing.",
    "F5_advice": "The Temporal lobe score of 78.52 indicates room for improvement in auditory processing, language, and emotional memory. Enhance these functions by listening to complex sounds (e.g., music, podcasts), practicing active listening, and engaging in conversations. Learning new words or languages can strengthen language centers. Emotional memory benefits from storytelling or reflecting on past experiences. Protect hearing by avoiding loud noises. Foods rich in magnesium (e.g., nuts, seeds) may support auditory health. If language or memory issues persist, consider speech therapy or memory training exercises. Stress reduction is key, as anxiety can impair temporal lobe function."
}