{
    "F1_advice": "The Frontal lobe score of 79.62 indicates strong executive function, motor control, and planning abilities. To maintain and further enhance these functions, engage in activities that challenge cognitive flexibility, such as strategic games (e.g., chess) or learning new skills. Physical exercise, particularly aerobic activities, can also support motor coordination. Practice time management and goal-setting to refine planning abilities. If occasional lapses in focus occur, mindfulness exercises may help improve sustained attention. Avoid excessive multitasking, as it can strain executive function.",
    "F2_advice": "The Parietal lobe score of 76.75 suggests solid spatial awareness and sensory integration. To bolster these functions, try activities like puzzles, map-reading, or spatial navigation games. Incorporate tactile tasks (e.g., crafting or playing a musical instrument) to strengthen sensory processing. Mindfulness practices can enhance attention. If you experience minor spatial disorientation, practice visualizing environments or using landmarks for navigation. Limit prolonged sedentary behavior, as physical movement supports spatial cognition.",
    "F3_advice": "The Hippocampus score of 79.96 reflects robust memory and emotional regulation. To maintain this, prioritize sleep, as it’s critical for memory consolidation. Engage in memory-enhancing activities like learning new languages or recalling details from past events. Aerobic exercise can promote hippocampal neurogenesis. Manage stress through techniques like meditation, as chronic stress can impair memory. Social interactions and novel experiences also support hippocampal health. If forgetfulness occurs occasionally, use mnemonic devices or journaling to reinforce recall.",
    "F4_advice": "The Occipital lobe score of 74.79 indicates adequate visual processing but room for improvement. Stimulate this region with activities like drawing, visual puzzles, or observing detailed artwork. Protect eye health by reducing screen time and ensuring proper lighting. Practice visual memory exercises, such as recalling scenes or faces. If visual fatigue occurs, take breaks and focus on distant objects. Incorporate foods rich in omega-3s and antioxidants to support visual neural pathways.",
    "F5_advice": "The Temporal lobe score of 74.79 suggests moderate auditory and language processing. Strengthen these functions by listening to complex sounds (e.g., music or podcasts) and practicing active listening. Engage in conversations or language-learning to enhance verbal memory. Reading aloud can improve auditory processing. Protect hearing by avoiding loud noises. If word-finding difficulties arise, practice naming objects or storytelling. Emotional regulation techniques, like deep breathing, can also support the temporal lobe’s role in mood stability."
}