{
    "F1_advice": "The Frontal lobe score of 74.6 indicates moderate performance in motor control, planning, coordination, and executive function. To improve, engage in activities that challenge executive functions, such as puzzles, strategic games, or learning new skills. Physical exercise, especially aerobic activities, can enhance motor coordination. Mindfulness practices may help with impulse control. If daily tasks are affected, consider breaking them into smaller steps. Monitor for signs of fatigue or frustration, as these may indicate overexertion. Regular sleep and a balanced diet are essential for optimal frontal lobe function.",
    "F2_advice": "The Parietal lobe score of 75.92 suggests adequate but not exceptional performance in sensory integration, spatial navigation, and attention. To enhance these functions, practice activities like drawing, map reading, or spatial puzzles. Mindfulness meditation can improve attention. Sensory stimulation, such as tactile exercises or balancing activities, may help. If you experience difficulty with spatial tasks, use tools like lists or reminders. Ensure adequate hydration and nutrition, as dehydration can impair cognitive performance. Limit multitasking to strengthen focused attention.",
    "F3_advice": "The Hippocampus score of 56.32 indicates significant room for improvement in memory and emotional regulation. Prioritize activities that boost memory, such as learning new languages, playing memory games, or recalling daily events. Aerobic exercise is particularly beneficial for hippocampal neurogenesis. Manage stress through techniques like deep breathing or yoga, as chronic stress can harm the hippocampus. Ensure sufficient sleep, as memory consolidation occurs during sleep. A diet rich in omega-3s and antioxidants supports brain health. If memory lapses persist, consider consulting a specialist for further evaluation.",
    "F4_advice": "The Occipital lobe score of 90.17 reflects strong visual processing and recognition abilities. To maintain this, engage in visually stimulating activities like art, photography, or visual puzzles. Protect eye health with regular check-ups and reduce screen time to prevent strain. Exposure to natural light and varied visual environments can keep the occipital lobe active. If you notice changes in vision or perception, seek professional advice. A diet rich in vitamins A and E supports visual health. Continue challenging your visual system with new and complex stimuli to sustain high performance.",
    "F5_advice": "The Temporal lobe score of 90.17 indicates excellent auditory processing, memory, and language skills. To maintain this, engage in activities like music, audiobooks, or language learning. Social interactions and discussions can further sharpen language and auditory skills. Protect hearing by avoiding prolonged exposure to loud noises. If you experience sudden changes in auditory or memory functions, consult a specialist. A balanced diet with nutrients like B vitamins supports auditory health. Continue to challenge your temporal lobe with new auditory and linguistic experiences to preserve its high functionality."
}